package mn_ovl_po;

return 1;

sub parameters { return {

'cp_keys' => 'koi8-r',
'cp_values' => 'koi8-u'

} };

sub translations { return {

'%d команд распознано' =>
'%d команд розп╕знан╕',

'%s (%d групп)' =>
'%s (%d груп)',

'Ваша подписка:' =>
'',

'Вы не наш пользователь - часть функций недоступна' =>
'Ви не ╓ нашим користувачем => частина функц╕й недоступна',

'Группа %s: %s' =>
'Група %s: %s',

'Группа %s: состояние не меняется: %s%s' =>
'Група %s: стан не зм╕ню╓ться: %s%s',

'Заголовки списков выключены' =>
'Заголовки списк╕в вимкнен╕',

'Иерархии верхнего уровня:' =>
'╤╓рарх╕╖ верхнього р╕вня:',

'Команда DELETE FROM subs не выполнена: отказ базы: %s' =>
'Команду DELETE FROM subs не виконано: в╕дмова бази',

'Команда DELETE FROM users не выполнена: отказ базы: %s' =>
'Команду DELETE FROM users не виконано: в╕дмова бази',

'Команда выполнена' =>
'Команду виконано',

'Команда выполнена, отправлено %d писем с %d записями' =>
'Команду виконано, в╕дправлено %d лист╕в з %d записами',

'Команда запрещена' =>
'Команда заборонена',

'Команда не выполнена' =>
'Команду не виконано',

'Команда не выполнена: возражение базы' =>
'Команду не виконано: в╕дмова бази',

'Команда не выполнена: некорректный параметр' =>
'Команду не виконано: некоректний параметр',

'Команда не выполнена: нет соединения с сервером' =>
"Команду не виконано: нема зв'зку з сервером",

'Команда не выполнена: отказ отдать заголовок: %s' =>
'Команду не виконано: в╕дмова в╕ддати заголовок',

'Команда не выполнена: отказ отдать тело статьи: %s' =>
'Команду не виконано: в╕дмова в╕ддати т╕ло статт╕',

'Команда не выполнена: отказ признать группу: %s' =>
'Команду не виконано: в╕дмова признати групу: %s',

'Команда синтаксически неправильна' =>
'Команда синтаксично нев╕рна',

'Команда успешно выполнена' =>
'Команду виконано',

'Не могу выполнить команду INSERT в базе: %s' =>
'Не можу виконати команду INSERT в баз╕: %s',

'Не могу выполнить команду UPDATE в базе' =>
'Не можу виконати команду UPDATE в баз╕',

'Не могу начать новое письмо с индексом' =>
'Не можу почати новий лист з ╕ндексом',

'Не могу подготовить INSERT: %s' =>
'Не можу п╕дготувами INSERT: %s',

'Не могу подготовить UPDATE: %s' =>
'Не можу п╕дготувати UPDATE: %s',

'Не могу подготовить команду' =>
'Не можу п╕дготувати команду',

'Не могу получить данные из базы' =>
'Не можу отримати дан╕ з бази',

'Не могу получить список конференций' =>
'Не можу отримати список конференц╕й',

'Не могу соединиться с сервером' =>
"Не можу встановити зв'язок з сервером",

'Недопустимая группа. Выбор группы сброшен.' =>
'Недозволена група. Виб╕р групи в╕дм╕нений',

'Нет связи с базой: %s. Команда не выполнена' =>
"Нема╓ зв'язку з базою: %s. Команду не виконано",

'Нет связи с базой: %s. Команда не выполнена.' =>
"Нема╓ зв'язку з базою: %s. Команду не виконано.",

'Нет текущей группы. Команда не выполнена' =>
'Нема╓ поточно╖ групи. Команду не виконано',

'Ни одной команды не распознано.' =>
'Жодно╖ команди не розп╕знано',

'Письмо номер %s со списком в ответ на запрос:' =>
'Лист номер %s з╕ списком у в╕дпов╕дь на запит:',

'Подписка возобновлена' =>
'П╕дписку в╕дновлено',

'Подписка всего домена приостановлена' =>
'П╕дписку всього домену припинено',

'Подписка на %s не выполнена по причине: %s' =>
'П╕дписку на %s не виконано тому що: %s',

'Подписка приостановлена' =>
'П╕дписку припинено',

'Подсказка временно недоступна' =>
'П╕дказка тимчасово недоступна',

'Результат запроса к серверу от <%s>' =>
'Результат замовлення до сервера в╕д <%s>',

'Текущая группа не выбрана' =>
'Поточна група не вибрана',

# 'Удаляется: %s' =>
# '',

'строка %d, письмо %s' =>
'рядок %d, лист %s',

'' => ''

} }
